app/controllers/sentences_controller.rb

  def index
    @domain = request.base_url
    @sentences = current_user.sentences.all.reverse
    @root_sentences = current_user.sentences.all.where(group: ["Home",""]).reverse

    @groups = current_user.sentences.all.distinct.pluck(:group)
    @folders_name = current_user.sentences.all.distinct.pluck(:group)

    if @groups.exclude?('Home')
      @groups.push('Home')
---
UPDATE "sentences" SET "sentence" = $1, "updated_at" = $2 WHERE "sentences"."id" = $3  [["sentence", "Ciao"], ["updated_at", "2020-02-21 08:47:35.408596"], ["id", 16]]