app/controllers/sentences_controller.rb

DELETE FROM "sentences" WHERE "sentences"."id" = $1  [["id", 5]]
---
  def destroy
    @sentence.destroy