app/controllers/sentences_controller.rb

  def destroy
    @sentence.destroy
---
DELETE FROM "sentences" WHERE "sentences"."id" = $1  [["id", 1]]

  def index
    @sentences = current_user.sentences.all.reverse
---
SELECT "sentences".* FROM "sentences" WHERE "sentences"."user_id" = $1  [["user_id", 1]]

  def apicreate
    request.format = :json

    @api_sentence =  params['sentence']
    @sentence = current_user.sentences.new()

    @sentence.sentence = @api_sentence
    @sentence.name = @api_sentence

    if @sentence.save
---
INSERT INTO "sentences" ("name", "sentence", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "sentence"], ["sentence", "sentence"], ["created_at", "2020-04-05 12:23:25.154122"], ["updated_at", "2020-04-05 12:23:25.154122"], ["user_id", 1]]

  def create
    @sentence = current_user.sentences.build(sentence_params)

    respond_to do |format|
      if @sentence.save
---
INSERT INTO "sentences" ("name", "sentence", "group", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["sentence", "ciao"], ["group", ""], ["created_at", "2020-07-27 03:49:48.817804"], ["updated_at", "2020-07-27 03:49:48.817804"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @sentence.update(sentence_params)
---
UPDATE "sentences" SET "sentence" = $1, "group" = $2, "updated_at" = $3 WHERE "sentences"."id" = $4  [["sentence", "sentence 2"], ["group", ""], ["updated_at", "2020-04-05 12:25:10.510556"], ["id", 28]]

    def set_sentence
      @sentence = Sentence.find(params[:id])
---
SELECT "sentences".* FROM "sentences" WHERE "sentences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]